---
title: DesignOptionFailures
classe: Autodesk.Revit.DB.BuiltInFailures+DesignOptionFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 43
---

# DesignOptionFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AreaTagLineCannotBeInDesignOption { get; }` | `DesignOptionFailures.AreaTagLineCannotBeInDesignOption` | FailureDefinitionId |
| `FailureDefinitionId BadReferenceBetweenOptions { get; }` | `DesignOptionFailures.BadReferenceBetweenOptions` | FailureDefinitionId |
| `FailureDefinitionId BadReferenceBetweenOptionsWarn { get; }` | `DesignOptionFailures.BadReferenceBetweenOptionsWarn` | FailureDefinitionId |
| `FailureDefinitionId BadReferenceToSecondary { get; }` | `DesignOptionFailures.BadReferenceToSecondary` | FailureDefinitionId |
| `FailureDefinitionId BadReferenceToSecondaryWarn { get; }` | `DesignOptionFailures.BadReferenceToSecondaryWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotAddToOptions { get; }` | `DesignOptionFailures.CannotAddToOptions` | FailureDefinitionId |
| `FailureDefinitionId CannotAddToOptionsWarn { get; }` | `DesignOptionFailures.CannotAddToOptionsWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotPutELAInOption { get; }` | `DesignOptionFailures.CannotPutELAInOption` | FailureDefinitionId |
| `FailureDefinitionId CannotPutELZInOption { get; }` | `DesignOptionFailures.CannotPutELZInOption` | FailureDefinitionId |
| `FailureDefinitionId CannotPutSpaceInOption { get; }` | `DesignOptionFailures.CannotPutSpaceInOption` | FailureDefinitionId |
| `FailureDefinitionId CannotPutZoneInOption { get; }` | `DesignOptionFailures.CannotPutZoneInOption` | FailureDefinitionId |
| `FailureDefinitionId ConfusingHostByElementsInAnotherDesignOption { get; }` | `DesignOptionFailures.ConfusingHostByElementsInAnotherDesignOption` | FailureDefinitionId |
| `FailureDefinitionId ConfusingHostByElementsInAnotherDesignOptionWarn { get; }` | `DesignOptionFailures.ConfusingHostByElementsInAnotherDesignOptionWarn` | FailureDefinitionId |
| `FailureDefinitionId ConfusingHostByElementsInDesignOption { get; }` | `DesignOptionFailures.ConfusingHostByElementsInDesignOption` | FailureDefinitionId |
| `FailureDefinitionId ConfusingHostByElementsInDesignOptionWarn { get; }` | `DesignOptionFailures.ConfusingHostByElementsInDesignOptionWarn` | FailureDefinitionId |
| `FailureDefinitionId ConfusingHostByElementsInMainModel { get; }` | `DesignOptionFailures.ConfusingHostByElementsInMainModel` | FailureDefinitionId |
| `FailureDefinitionId ConfusingHostByElementsInMainModelWarn { get; }` | `DesignOptionFailures.ConfusingHostByElementsInMainModelWarn` | FailureDefinitionId |
| `FailureDefinitionId ConfusingPadByElementsInAnotherDesignOption { get; }` | `DesignOptionFailures.ConfusingPadByElementsInAnotherDesignOption` | FailureDefinitionId |
| `FailureDefinitionId ConfusingPadByElementsInAnotherDesignOptionWarn { get; }` | `DesignOptionFailures.ConfusingPadByElementsInAnotherDesignOptionWarn` | FailureDefinitionId |
| `FailureDefinitionId ConfusingPadByElementsInDesignOption { get; }` | `DesignOptionFailures.ConfusingPadByElementsInDesignOption` | FailureDefinitionId |
| `FailureDefinitionId ConfusingPadByElementsInDesignOptionWarn { get; }` | `DesignOptionFailures.ConfusingPadByElementsInDesignOptionWarn` | FailureDefinitionId |
| `FailureDefinitionId ConfusingPadByElementsInMainModel { get; }` | `DesignOptionFailures.ConfusingPadByElementsInMainModel` | FailureDefinitionId |
| `FailureDefinitionId ConfusingPadByElementsInMainModelWarn { get; }` | `DesignOptionFailures.ConfusingPadByElementsInMainModelWarn` | FailureDefinitionId |
| `FailureDefinitionId ConfusingSweepByElementsInAnotherDesignOption { get; }` | `DesignOptionFailures.ConfusingSweepByElementsInAnotherDesignOption` | FailureDefinitionId |
| `FailureDefinitionId ConfusingSweepByElementsInAnotherDesignOptionWarn { get; }` | `DesignOptionFailures.ConfusingSweepByElementsInAnotherDesignOptionWarn` | FailureDefinitionId |
| `FailureDefinitionId ConfusingSweepByElementsInDesignOption { get; }` | `DesignOptionFailures.ConfusingSweepByElementsInDesignOption` | FailureDefinitionId |
| `FailureDefinitionId ConfusingSweepByElementsInDesignOptionWarn { get; }` | `DesignOptionFailures.ConfusingSweepByElementsInDesignOptionWarn` | FailureDefinitionId |
| `FailureDefinitionId ConfusingSweepByElementsInMainModel { get; }` | `DesignOptionFailures.ConfusingSweepByElementsInMainModel` | FailureDefinitionId |
| `FailureDefinitionId ConfusingSweepByElementsInMainModelWarn { get; }` | `DesignOptionFailures.ConfusingSweepByElementsInMainModelWarn` | FailureDefinitionId |
| `FailureDefinitionId DebugLevelsInOptionsError { get; }` | `DesignOptionFailures.DebugLevelsInOptionsError` | FailureDefinitionId |
| `FailureDefinitionId DebugLevelsInOptionsWarn { get; }` | `DesignOptionFailures.DebugLevelsInOptionsWarn` | FailureDefinitionId |
| `FailureDefinitionId ElementsWillBeDeletedNoOption { get; }` | `DesignOptionFailures.ElementsWillBeDeletedNoOption` | FailureDefinitionId |
| `FailureDefinitionId FabricationCannotBeInDesignOption { get; }` | `DesignOptionFailures.FabricationCannotBeInDesignOption` | FailureDefinitionId |
| `FailureDefinitionId KingNeverInOption { get; }` | `DesignOptionFailures.KingNeverInOption` | FailureDefinitionId |
| `FailureDefinitionId KingNeverInOptionWarn { get; }` | `DesignOptionFailures.KingNeverInOptionWarn` | FailureDefinitionId |
| `FailureDefinitionId MustAddKing { get; }` | `DesignOptionFailures.MustAddKing` | FailureDefinitionId |
| `FailureDefinitionId MustAddKingWarn { get; }` | `DesignOptionFailures.MustAddKingWarn` | FailureDefinitionId |
| `FailureDefinitionId MustBeInMainModel { get; }` | `DesignOptionFailures.MustBeInMainModel` | FailureDefinitionId |
| `FailureDefinitionId NeverInOption { get; }` | `DesignOptionFailures.NeverInOption` | FailureDefinitionId |
| `FailureDefinitionId NeverInOptionWarn { get; }` | `DesignOptionFailures.NeverInOptionWarn` | FailureDefinitionId |
| `FailureDefinitionId NoSelectedInOption { get; }` | `DesignOptionFailures.NoSelectedInOption` | FailureDefinitionId |
| `FailureDefinitionId OptionElementsDeleted { get; }` | `DesignOptionFailures.OptionElementsDeleted` | FailureDefinitionId |
| `FailureDefinitionId SelectionIncludesOptionItems { get; }` | `DesignOptionFailures.SelectionIncludesOptionItems` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```